---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnPipeWarn
source: html/aa5075ac-0366-39c0-ae84-3d8b651df5e4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnPipeWarn Property

The [Tap] must be attached to pipe.

## Syntax (C#)
```csharp
public static FailureDefinitionId FittingMustBeOnPipeWarn { get; }
```